Dataframes

In [2]:
import pandas as pd

16.2 Simple Python Version

16.3 Dataframe

In [3]:
t = {'growth':[.5,.7,1.2],
                   'Name':['Paul','George','Rindo']}
df = pd.DataFrame({'growth':[.5,.7,1.2],
                   'Name':['Paul','George','Rindo']})

In [13]:
df

   growth    Name
0     0.5    Paul
1     0.7  George
2     1.2   Rindo

In [10]:
df.iloc[2]

growth      1.2
Name      Rindo
Name: 2, dtype: object

In [14]:
df['Name']

0      Paul
1    George
2     Rindo
Name: Name, dtype: object

In [12]:
type(df['Name'])

pandas.core.series.Series

In [15]:
# column names with space or named the same as functions will not work
df.Name

0      Paul
1    George
2     Rindo
Name: Name, dtype: object

16.4 Construction

In [18]:
# dataframe from rows
pd.DataFrame([
    {'growth':.5, 'Name':'Paul'},
    {'growth':.7, 'Name':'George'},
    {'growth':1.2, 'Name':'Ringo'}]
)

   growth    Name
0     0.5    Paul
1     0.7  George
2     1.2   Ringo

In [19]:
from io import StringIO
csv_file = StringIO("""growth,Name
    .5,Paul
    .7,George
    1.2,Ringo""")

pd.read_csv(csv_file)

   growth    Name
0     0.5    Paul
1     0.7  George
2     1.2   Ringo

In [20]:
import numpy as np
np.random.seed(50)
pd.DataFrame(np.random.randn(10,3),
             columns=['a','b','c'])

          a         b         c
0 -1.560352 -0.030978 -0.620928
1 -1.464580  1.411946 -0.476732
2 -0.780469  1.070268 -1.282293
3 -1.327479  0.126338  0.862194
4  0.696737 -0.334565 -0.997526
5  1.598908  3.314075  0.987770
6  0.123866  0.742785 -0.393956
7  0.148116 -0.412234 -0.160715
8  0.139531  0.285469 -0.281262
9  1.710907 -0.149767  0.690307

16.5 Dataframe Axis

In [21]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['growth', 'Name'], dtype='object')]

In [23]:
df.sum(axis=0)

growth                2.4
Name      PaulGeorgeRindo
dtype: object

In [24]:
df.sum(axis=1)

C:\Users\wgrom\AppData\Local\Temp/ipykernel_5216/1459321664.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis=1)

0    0.5
1    0.7
2    1.2
dtype: float64

In [25]:
df.sum(axis='index')

growth                2.4
Name      PaulGeorgeRindo
dtype: object

In [26]:
df.sum(axis='columns')

C:\Users\wgrom\AppData\Local\Temp/ipykernel_5216/4283019124.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis='columns')

0    0.5
1    0.7
2    1.2
dtype: float64

In [27]:
df.axes[0]

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.axes[1]

Index(['growth', 'Name'], dtype='object')

In [30]:
dataf = pd.DataFrame({'Score1':[None,None],
                          'Score2':[85,90]}
                        )

In [31]:
dataf

  Score1  Score2
0   None      85
1   None      90

In [32]:
dataf.apply(np.sum, axis=0)

growth                2.4
Name      PaulGeorgeRindo
dtype: object

In [34]:
dataf.apply(np.sum,axis=1)

0    85
1    90
dtype: int64

16.7 Exercises

In [36]:
collegues = { 'Name':['Bob','John','Lisa','Debbie'], 'Age':[25,55,27,34]}

collegues_DF = pd.DataFrame(data=collegues)

In [37]:
collegues_DF

     Name  Age
0     Bob   25
1    John   55
2    Lisa   27
3  Debbie   34

In [45]:
collegues_DF.Name.str.upper()

0       BOB
1      JOHN
2      LISA
3    DEBBIE
Name: Name, dtype: object

In [48]:
collegues_DF['Name'] = collegues_DF['Name'].str.upper()

In [49]:
collegues_DF

     Name  Age
0     BOB   25
1    JOHN   55
2    LISA   27
3  DEBBIE   34

In [38]:
collegues_DF.apply(np.sum, axis=0)

Name    BobJohnLisaDebbie
Age                   141
dtype: object